#+TITLE: Managing Projects with GNU Make
#+AUTHOR: Robert Mecklenberg
#+DATE: 2005
#+EMAIL: evan@mantle.co
#+CREATOR: Evan Nagle
#+TAGS: @linux

* A simple makefile

  #+BEGIN_SRC sh :results scalar
make task3 -f data/simple/Makefile
  #+END_SRC

  #+RESULTS:
  : echo "Task 1"
  : Task 1
  : echo "Task 2"
  : Task 2
  : echo "Task 3"
  : Task 3

* Multiple Targets

#+BEGIN_SRC sh :results scalar
make target2 -f data/multi-target/Makefile
#+END_SRC

#+RESULTS:
: You picked target2.
: And I'm impressed.

** Command runs if dependencies are newer than the target.
#+BEGIN_SRC sh :results scalar
  touch data/double-colon/file-a.txt

  make data/double-colon/file-c.txt -f data/double-colon/Makefile
#+END_SRC

#+RESULTS:
: echo "file-a was updated"
: file-a was updated

** Append to var with +=

#+BEGIN_SRC sh :results scalar
make whats-glue -f data/vars/Makefile
make whats-glue2 -f data/vars/Makefile
#+END_SRC

#+RESULTS:
: a b
: a b c

** $(call <function>,<arg1,...,argN>) = executes function with args

#+BEGIN_SRC sh :results scalar
make -f data/macros/Makefile
#+END_SRC

#+RESULTS:
: running 'simple_function' on all...
: running 'function_with_args' on all...
: -- variable: foo

